app/Controllers/Auth.php

INSERT INTO `users` (`name`, `email`, `password`) VALUES ('Mik Wick', 'mik@hotmail.com', 'mikei123')
---
                'password' => Hash::make($password),
            ];
            $usersModel = new \App\Models\UserModel();
            $query = $usersModel->insert($values);

SELECT *
FROM `users`
WHERE `email` = 'mikeicompras@hotmail.com'
 LIMIT 1
---
    function check(){
       $validation = $this->validate([
        'email'=>[
            'rules'=>'required|valid_email|is_not_unique[users.email]',
            'errors'=>[
                'required'=>'Email is required',
                'valid_email'=>'Enter a valid email adress',
                'is_not_unique'=>'This email is not registred on our service'
            ]
            ],
        'password'=>[
            'rules'=>'required|min_length[5]|max_length[12]',
            'errors'=>[
                'required'=>'Password is required',
                'min_length'=>'Password must have atleast 5 characters in length',
                'max_length'=>'Password must not have more than 12 characters.'
            ]
        ]
        ]);

        if(!$validation){
            return view('auth/login',['validation'=>$this->validator]);
        }else{

            $email = $this->request->getPost('email');
            $password = $this->request->getPost('password');
            $usersModel = new \App\Models\UserModel();
            $user_info = $usersModel->where('email', $email)->first();