app/Controllers/Dashboard.php

    public function dash()
    {
        $usersModel = new \App\Models\UserModel();
        $loggedUserID = session()->get('loggedUser');
        $userInfo = $usersModel->find($loggedUserID);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '14'